<script setup>
const usageList = [
  {
    title: "Кто может быть владельцем бизнес-карты",
    subtitle:
      "Бизнес-карта выпускается на имя держателей — сотрудников клиента, которые уполномочены клиентом на совершение операций по счёту с использованием бизнес-карты или её реквизитов.",
    image: "https://s56442.cdn.ngenix.net/api/ext/svg-data/svg/rshb/contentlanding/salary_employees.svg",
    content: [
      "Держателей может быть не более двух.",
      "Держатель не является владельцем счёта бизнес-карты.",
      "На каждого держателя может быть выпущено не более одной бизнес-карты; всего — не более двух бизнес-карт к счёту.",
      "Клиент может открыть не более одного счёта бизнес-карты по одному продукту.",
      "Выпуск, перевыпуск, замена бизнес-карт — только в период действия лимита бизнес-карты, установленного договором.",
      "Выпуск, перевыпуск, замена бизнес-карт в случае отмены или приостановки лимита бизнес-карты не осуществляется.",
    ],
  },
  {
    title: "Что такое льготный период",
    subtitle:
      "Льготный период — это срок, в течение которого банк не начисляет проценты за совершение платежей при помощи заёмных средств. Условия для клиента:",
    image: "https://s56442.cdn.ngenix.net/api/ext/svg-data/svg/rshb/contentlanding/transfer_04.svg",
    content: [
      "Отсутствует просроченная задолженность по договору, уплачены неустойки",
      "Уплачены проценты, начисленные на нельготную задолженность",
      "До платежной даты погашена сумма основного долга, образовавшегося на конец процентного периода",
      "Погашена вся сумма сверхлимитной задолженности, образованная до платёжной даты, а также проценты",
    ],
  },
  {
    title: "Сроки льготного периода",
    subtitle:
      "Льготный период начинается с даты совершения льготной операции с использованием бизнес-карты и заканчивается не позднее 25 числа следующего месяца.",
    image: "https://s56442.cdn.ngenix.net/api/ext/svg-data/svg/rshb/contentlanding/certificate_expires_1_.svg",
    content: [
      "Продолжительность льготного периода — не более 55 календарных дней",
      "Клиент может погасить кредит ранее 55 дней, в этом случае льготный период будет заканчиваться в день фактического исполнения условий",
      "Если 25 число календарного месяца приходится на нерабочий день, то дата платежа переносится на следующий за ним рабочий день",
      "Последний льготный период заканчивается в дату окончания срока действия лимита бизнес-карты",
    ],
  },
];
</script>

<template>
  <div class="container py-8">
    <h2 class="text-2xl text-zinc-900 font-medium">Выпуск и использование бизнес-карты</h2>
    <ul class="mt-8">
      <li
        v-for="(item, index) in usageList"
        class="flex items-center justify-between gap-5 bg-white rounded-xl p-8 pb-10 mb-6"
        :class="{ 'flex-row-reverse': index % 2 !== 0 }"
      >
        <div class="flex-1">
          <h3 class="text-2xl text-zinc-900 font-semibold">{{ item.title }}</h3>
          <p class="text-zinc-900 mt-6">{{ item.subtitle }}</p>
          <ul class="list flex flex-col gap-3 mt-6">
            <li v-for="child in item.content">{{ child }}</li>
          </ul>
        </div>

        <div class="flex-1 flex justify-center items-center">
          <img :src="item.image" alt="" class="max-w-[320px] w-full object-contain" />
        </div>
      </li>
    </ul>
  </div>
</template>

<style scoped>
.list {
  list-style: disc;
  list-style-position: inside;
}

.list li::marker {
  color: green;
}
</style>
