const upperLinks = [
  {
    name: "О компании",
    link: "/",
  },
  {
    name: "О проетке Менинг томорқам",
    link: "",
  },
  {
    name: "Обратная связь",
    isModal: true,
  },
  {
    name: "Партнеры",
    link: "/partners",
  },
];

const bottomLinks = [
  {
    name: "Господдержка",
    children: [
      {
        name: "Подобрать кредит по параметрам",
      },
      {
        name: "Льготное кредитование сельхозпроизводителей",
      },
      {
        name: "Кредит на приобретение сельхозтехники",
      },
      {
        name: "Льготное кредитование возобновляемых источников энергии",
      },
      {
        name: "Субсидии",
      },
      {
        name: "Факторинг",
      },
      {
        name: "Лизинг сельхозтехники",
      },
      {
        name: "Услуги страхования",
      },
    ],
  },
  {
    name: "Агротехнологии",
    children: [
      {
        name: "Решение для теплиц на основе ИИ",
      },
      {
        name: "ТН ВЭД коды 2022",
      },
      {
        name: "Средства защиты растений",
      },
      {
        name: "Стимуляторы роста",
      },
      {
        name: "Биологические фунгициды",
      },
      {
        name: "Деструкторы пожнивных остатков",
      },
    ],
  },
  {
    name: "Товары",
    children: [
      {
        name: "Сельхозтехника",
      },
      {
        name: "Семена",
      },
      {
        name: "Саженцы",
      },
      {
        name: "Удобрения",
      },
      {
        name: "Оборудование",
      },
      {
        name: "Защита растений",
      },
    ],
  },
  {
    name: "Работа",
    children: [
      {
        name: "Работодателям",
      },
      {
        name: "Соискателям",
      },
      {
        name: "Разместить вакансию",
      },
      {
        name: "Разместить резюме",
      },
    ],
  },
  {
    name: "Услуги",
    children: [
      {
        name: "Поставщикам услуг",
      },
    ],
  },
  {
    name: "Своё Медиа",
    children: [
      {
        name: "Статьи",
      },
      {
        name: "Новости",
      },
      {
        name: "Видео",
      },
    ],
  },
];

export { upperLinks, bottomLinks };
