const upperLinks = [
  {
    name: "О компании",
  },
  {
    name: "О проетке Менинг томорқам",
  },
  {
    name: "Партнеры",
  },
];

const bottomLinks = [
  {
    name: "Господдержка",
    children: [
      {
        name: "Кредиты для агропромышленного комплекса",
      },
      {
        name: "Расчетный счет",
      },
      {
        name: "Эквайринг «Рецепт для бизнеса»",
      },
      {
        name: "Карта фермера",
      },
      {
        name: "Регистрация бизнеса",
      },
      {
        name: "Лизинг",
      },
      {
        name: "КАСКО",
      },
    ],
  },
  {
    name: "Агротехнологии",
    children: [
      {
        name: "Решение для теплиц на основе ИИ",
      },
      {
        name: "ТН ВЭД коды 2023",
      },
      {
        name: "Средства защиты растений",
      },
      {
        name: "Стимуляторы роста",
      },
      {
        name: "Биологические фунгициды",
      },
      {
        name: "Деструкторы пожнивных остатков",
      },
    ],
  },
  {
    name: "Товары",
    children: [
      {
        name: "Сельхозтехника",
      },
      {
        name: "Семена",
      },
      {
        name: "Саженцы",
      },
      {
        name: "Удобрения",
      },
      {
        name: "Оборудование",
      },
      {
        name: "Защита растений",
      },
    ],
  },
  {
    name: "Услуги",
    children: [
      {
        name: "Поставщикам услуг",
      },
    ],
  },
  {
    name: "Своё Медиа",
    children: [
      {
        name: "Статьи",
      },
      {
        name: "Новости",
      },
      {
        name: "Видео",
      },
    ],
  },
  {
    name: "Агростарт",
    children: [
      {
        name: "Бизнес-план по выращиванию фруктов и овощей",
      },
      {
        name: "Наставники",
      },
    ],
  },
  {
    name: "Работа",
    children: [],
  },
];

export { upperLinks, bottomLinks };
