const upperLinks = [
  {
    name: "О компании",
  },
  {
    name: "О проетке Менинг томорқам",
  },
  {
    name: "Партнеры",
  },
];

const bottomLinks = [
  {
    name: "Господдержка",
    children: [
      {
        name: "Кредиты для агропромышленного комплекса",
      },
      {
        name: "Расчетный счет",
      },
      {
        name: "Эквайринг «Рецепт для бизнеса»",
      },
      {
        name: "Карта фермера",
      },
      {
        name: "Регистрация бизнеса",
      },
      {
        name: "Лизинг",
      },
      {
        name: "КАСКО",
      },
    ],
  },
  {
    name: "Агротехнологии",
    children: [
      {
        name: "ТВ-ветеринар",
      },
      {
        name: "Иннагро",
      },
      {
        name: "Карта предприятий",
      },
      {
        name: "Объявления внешней торговли",
      },
      {
        name: "Меры поддержки",
      },
    ],
  },
  {
    name: "Товары",
    children: [
      {
        name: "Сельскохозяйственная техника",
      },
      {
        name: "Запчасти",
      },
      {
        name: "Семена",
      },
      {
        name: "Удобрения",
      },
    ],
  },
];

export { upperLinks, bottomLinks };
