<script setup></script>

<template>
  <div class="container py-8">
    <h2 class="text-2xl text-zinc-900 font-medium">Условия по обслуживанию и операциям по кредитной карте</h2>
    <ul class="grid grid-cols-2 gap-5 mt-6">
      <!-- list-item -->
      <li class="bg-white rounded-xl p-7 pb-12">
        <h3 class="text-2xl text-zinc-900 font-medium">Основные условия</h3>
        <div class="text-zinc-900 leading-[1.8] mt-6">
          <b>Срок действия:</b> 3 года <br />
          <b>Тип карты:</b> МИР <br />
          <b>Валюта счёта:</b> Рубли <br />
          <b>Выпуск карты:</b> Бесплатно <br />
          <b>Заказ выписок и справок:</b> Бесплатно <br />
          <b>Оплата товаров и услуг:</b> Бесплатно <br />
          <b>Зачисление и перевод средств:</b> Бесплатно <br />
        </div>
      </li>
      <!-- list-item -->
      <li class="bg-white rounded-xl p-7 pb-12">
        <h3 class="text-2xl text-zinc-900 font-medium">Обслуживание и операции с наличными средствами</h3>
        <div class="text-zinc-900 leading-[1.8] mt-6">
          <b>Обслуживание:</b> Бесплатно<br />
          <b>Блокировка карты:</b> Бесплатно<br />
          <b>SMS-сервис по номеру 7787:</b> 60 ₽<br />
          <b>Выпуск карты:</b> Бесплатно<br />
          <b>Снятие наличных:</b><br />
          - до 500 000 ₽: 3,5% от суммы, минимум 250 ₽<br />
          - от 500 000 ₽ до 1 000 000 ₽: 6% от суммы, минимум 250 ₽<br />
          - свыше 1 000 000 ₽: 9% от суммы, минимум 250 ₽<br />
          <b>Лимит выдачи наличных:</b> Техника<br />
          - в день: 300 000 ₽<br />
          - в месяц: 3 000 000 ₽<br />
          <b>Внесение наличных на р/с в терминалах и банкоматах любых банков:</b><br />
          - тариф: 0,15% от суммы внесения<br />
          - лимит внесения: без лимита<br />
        </div>
      </li>
    </ul>
  </div>
</template>
